{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "TBn_in"}, "name": "TBn_in", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "TSBn_in"}, "name": "TSBn_in", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "PSn_in"}, "name": "PSn_in", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "PCn_in"}, "name": "PCn_in", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "joinModelInput", "trainable": true, "dtype": "float32", "axis": -1}, "name": "joinModelInput", "inbound_nodes": [[["TBn_in", 0, 0, {}], ["TSBn_in", 0, 0, {}], ["PSn_in", 0, 0, {}], ["PCn_in", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bi_enc_lstm_0", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "enc_lstm_0", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 24, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.4, "implementation": 1}}, "merge_mode": "concat"}, "name": "bi_enc_lstm_0", "inbound_nodes": [[["joinModelInput", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bi_enc_lstm_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "enc_lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 24, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.4, "implementation": 1}}, "merge_mode": "concat"}, "name": "bi_enc_lstm_1", "inbound_nodes": [[["bi_enc_lstm_0", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bi_enc_lstm_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "enc_lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 24, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.4, "implementation": 1}}, "merge_mode": "concat"}, "name": "bi_enc_lstm_2", "inbound_nodes": [[["bi_enc_lstm_1", 0, 0, {}]]]}], "input_layers": [["TBn_in", 0, 0], ["TSBn_in", 0, 0], ["PSn_in", 0, 0], ["PCn_in", 0, 0]], "output_layers": [["bi_enc_lstm_2", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bi_enc_lstm_0/forward_enc_lstm_0/lstm_cell_1/kernel", "shape": [21, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_0/forward_enc_lstm_0/lstm_cell_1/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_0/forward_enc_lstm_0/lstm_cell_1/bias", "shape": [96], "dtype": "float32"}, {"name": "bi_enc_lstm_0/backward_enc_lstm_0/lstm_cell_2/kernel", "shape": [21, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_0/backward_enc_lstm_0/lstm_cell_2/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_0/backward_enc_lstm_0/lstm_cell_2/bias", "shape": [96], "dtype": "float32"}, {"name": "bi_enc_lstm_1/forward_enc_lstm_1/lstm_cell_4/kernel", "shape": [48, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_1/forward_enc_lstm_1/lstm_cell_4/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_1/forward_enc_lstm_1/lstm_cell_4/bias", "shape": [96], "dtype": "float32"}, {"name": "bi_enc_lstm_1/backward_enc_lstm_1/lstm_cell_5/kernel", "shape": [48, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_1/backward_enc_lstm_1/lstm_cell_5/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_1/backward_enc_lstm_1/lstm_cell_5/bias", "shape": [96], "dtype": "float32"}, {"name": "bi_enc_lstm_2/forward_enc_lstm_2/lstm_cell_7/kernel", "shape": [48, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_2/forward_enc_lstm_2/lstm_cell_7/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_2/forward_enc_lstm_2/lstm_cell_7/bias", "shape": [96], "dtype": "float32"}, {"name": "bi_enc_lstm_2/backward_enc_lstm_2/lstm_cell_8/kernel", "shape": [48, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_2/backward_enc_lstm_2/lstm_cell_8/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bi_enc_lstm_2/backward_enc_lstm_2/lstm_cell_8/bias", "shape": [96], "dtype": "float32"}]}]}