{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 1, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Vn_ar"}, "name": "Vn_ar", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 1, 48], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoded"}, "name": "encoded", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["Vn_ar", 0, 0, {}], ["encoded", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "uni_lstm_0", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 24, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.4, "implementation": 1}, "name": "uni_lstm_0", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "uni_lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 24, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.4, "implementation": 1}, "name": "uni_lstm_1", "inbound_nodes": [[["uni_lstm_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Vn_out", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Vn_out", "inbound_nodes": [[["uni_lstm_1", 0, 0, {}]]]}], "input_layers": [["Vn_ar", 0, 0], ["encoded", 0, 0]], "output_layers": [["Vn_out", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Vn_out/kernel", "shape": [24, 1], "dtype": "float32"}, {"name": "Vn_out/bias", "shape": [1], "dtype": "float32"}, {"name": "uni_lstm_0/lstm_cell_9/kernel", "shape": [49, 96], "dtype": "float32"}, {"name": "uni_lstm_0/lstm_cell_9/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "uni_lstm_0/lstm_cell_9/bias", "shape": [96], "dtype": "float32"}, {"name": "uni_lstm_1/lstm_cell_10/kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "uni_lstm_1/lstm_cell_10/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "uni_lstm_1/lstm_cell_10/bias", "shape": [96], "dtype": "float32"}]}]}